Revit 2024 API
ConnectorElement.FlipDirection Method
 Reverses the direction of the connector element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public void FlipDirection()
Visual Basic
Public Sub FlipDirection
Visual C++
public:
void FlipDirection()
See Also
ConnectorElement Class
Autodesk.Revit.DB Namespace